import { TCssFontSize } from "#types"
import React from "react"

export abstract class TextStory 
{
  public static BigText = (fontSize: TCssFontSize = 'large') => 
  {
    return <>
      <div style={{ fontSize: fontSize }}><div style={{ fontSize: 'large', lineHeight: '1.5' }}>Давно выяснено,
        что при оценке дизайна и композиции читаемый текст мешает сосредоточиться.
        Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона,
        а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации
        "Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.." Многие программы электронной вёрстки и
        редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по
        ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения.
        За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке,
        некоторые - намеренно (например, юмористические варианты).</div>
        <div style={{ fontSize: fontSize, lineHeight: '1.5' }}>Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться.
          Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона,
          а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации
          "Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.." Многие программы электронной вёрстки и
          редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по
          ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения.
          За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке,
          некоторые - намеренно (например, юмористические варианты).</div>
        <div style={{ fontSize: fontSize, lineHeight: '1.5' }}>Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться.
          Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона,
          а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации
          "Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.." Многие программы электронной вёрстки и
          редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по
          ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения.
          За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке,
          некоторые - намеренно (например, юмористические варианты).</div>
        <div style={{ fontSize: fontSize, lineHeight: '1.5' }}>Многие думают, что Lorem Ipsum - взятый с потолка псевдо-латинский набор слов, но это не совсем так.
          Его корни уходят в один фрагмент классической латыни 45 года н.э., то есть более двух тысячелетий назад. Ричард МакКлинток,
          профессор латыни из колледжа Hampden-Sydney, штат Вирджиния, взял одно из самых странных слов в Lorem Ipsum, "consectetur", и
          занялся его поисками в классической латинской литературе. В результате он нашёл неоспоримый первоисточник
          Lorem Ipsum в разделах 1.10.32 и 1.10.33 книги "de Finibus Bonorum et Malorum" ("О пределах добра и зла"),
          написанной Цицероном в 45 году н.э. Этот трактат по теории этики был очень популярен в эпоху Возрождения.
          Первая строка Lorem Ipsum, "Lorem ipsum dolor sit amet..", происходит от одной из строк в разделе 1.10.32</div>
        <div style={{ fontSize: fontSize, lineHeight: '1.5' }}>Многие думают, что Lorem Ipsum - взятый с потолка псевдо-латинский набор слов, но это не совсем так.
          Его корни уходят в один фрагмент классической латыни 45 года н.э., то есть более двух тысячелетий назад. Ричард МакКлинток,
          профессор латыни из колледжа Hampden-Sydney, штат Вирджиния, взял одно из самых странных слов в Lorem Ipsum, "consectetur", и
          занялся его поисками в классической латинской литературе. В результате он нашёл неоспоримый первоисточник
          Lorem Ipsum в разделах 1.10.32 и 1.10.33 книги "de Finibus Bonorum et Malorum" ("О пределах добра и зла"),
          написанной Цицероном в 45 году н.э. Этот трактат по теории этики был очень популярен в эпоху Возрождения.
          Первая строка Lorem Ipsum, "Lorem ipsum dolor sit amet..", происходит от одной из строк в разделе 1.10.32</div>
        <div style={{ fontSize: fontSize, lineHeight: '1.5' }}>Многие думают, что Lorem Ipsum - взятый с потолка псевдо-латинский набор слов, но это не совсем так.
          Его корни уходят в один фрагмент классической латыни 45 года н.э., то есть более двух тысячелетий назад. Ричард МакКлинток,
          профессор латыни из колледжа Hampden-Sydney, штат Вирджиния, взял одно из самых странных слов в Lorem Ipsum, "consectetur", и
          занялся его поисками в классической латинской литературе. В результате он нашёл неоспоримый первоисточник
          Lorem Ipsum в разделах 1.10.32 и 1.10.33 книги "de Finibus Bonorum et Malorum" ("О пределах добра и зла"),
          написанной Цицероном в 45 году н.э. Этот трактат по теории этики был очень популярен в эпоху Возрождения.
          Первая строка Lorem Ipsum, "Lorem ipsum dolor sit amet..", происходит от одной из строк в разделе 1.10.32</div>
        <div style={{ fontSize: fontSize, lineHeight: '1.5' }}>Многие думают, что Lorem Ipsum - взятый с потолка псевдо-латинский набор слов, но это не совсем так.
          Его корни уходят в один фрагмент классической латыни 45 года н.э., то есть более двух тысячелетий назад. Ричард МакКлинток,
          профессор латыни из колледжа Hampden-Sydney, штат Вирджиния, взял одно из самых странных слов в Lorem Ipsum, "consectetur", и
          занялся его поисками в классической латинской литературе. В результате он нашёл неоспоримый первоисточник
          Lorem Ipsum в разделах 1.10.32 и 1.10.33 книги "de Finibus Bonorum et Malorum" ("О пределах добра и зла"),
          написанной Цицероном в 45 году н.э. Этот трактат по теории этики был очень популярен в эпоху Возрождения.
          Первая строка Lorem Ipsum, "Lorem ipsum dolor sit amet..", происходит от одной из строк в разделе 1.10.32</div>
      </div>
    </>
  }

  public static MiddleText = (fontSize: TCssFontSize = 'large') => 
  {
    return <>
      <div style={{ fontSize: fontSize }}><div style={{ fontSize: 'large', lineHeight: '1.5' }}>Давно выяснено,
        что при оценке дизайна и композиции читаемый текст мешает сосредоточиться.
        Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона,
        а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации
        "Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.." Многие программы электронной вёрстки и
        редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по
        ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения.
        За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке,
        некоторые - намеренно (например, юмористические варианты).</div>
        <div style={{ fontSize: fontSize, lineHeight: '1.5' }}>Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться.
          Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона,
          а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации
          "Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.." Многие программы электронной вёрстки и
          редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по
          ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения.
          За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке,
          некоторые - намеренно (например, юмористические варианты).</div>
        <div style={{ fontSize: fontSize, lineHeight: '1.5' }}>Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться.
          Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона,
          а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации
          "Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.." Многие программы электронной вёрстки и
          редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по
          ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения.
          За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке,
          некоторые - намеренно (например, юмористические варианты).</div>
        <div style={{ fontSize: fontSize, lineHeight: '1.5' }}>Многие думают, что Lorem Ipsum - взятый с потолка псевдо-латинский набор слов, но это не совсем так.
          Его корни уходят в один фрагмент классической латыни 45 года н.э., то есть более двух тысячелетий назад. Ричард МакКлинток,
          профессор латыни из колледжа Hampden-Sydney, штат Вирджиния, взял одно из самых странных слов в Lorem Ipsum, "consectetur", и
          занялся его поисками в классической латинской литературе. В результате он нашёл неоспоримый первоисточник
          Lorem Ipsum в разделах 1.10.32 и 1.10.33 книги "de Finibus Bonorum et Malorum" ("О пределах добра и зла"),
          написанной Цицероном в 45 году н.э. Этот трактат по теории этики был очень популярен в эпоху Возрождения.
          Первая строка Lorem Ipsum, "Lorem ipsum dolor sit amet..", происходит от одной из строк в разделе 1.10.32</div>
      </div>
    </>
  }

  public static SmallText = (fontSize: TCssFontSize = 'middle') => 
    {
      return <>
          <div style={{ fontSize: fontSize,}}>Текс рассуждения на тему спорт: Спорт-это наша жизнь, а жизнь это спорт. Приведу аргументы к тезису. 
            Спортом мы занимаемся с 1-ого класса и из-за этого мы меньше болеем. Некоторые ходят на всякие тренировки и становятся спортивней,здоровей, 
            чем те кто просто ходит в школе на физкультуру. Поэтому мы доказали, что спорт полезен</div>
          <div style={{ fontSize: fontSize }}>Пример текста-рассуждения — это логически выстроенное изложение
             мыслей с целью объяснить что-либо, ответить на вопрос «почему?» и подкрепить свою точку зрения аргументами и примерами. 
             Примером может служить объяснение, почему енотов называют полоскунами, где сначала указывается факт (они моют еду), 
             а затем приводится аргумент, подтверждающий этот факт</div>
      </>
    }
}
